cask_args appdir: '/Applications'

brew 'git'
brew 'imagemagick'
brew 'spaceman-diff'
brew 'wget'
brew 'yt-dlp'

cask '1password'
cask 'balenaetcher'
cask 'discord'
cask 'firefox'
cask 'moonlight'
cask 'obsidian'
cask 'rectangle'
cask 'spotify'
cask 'steam'
cask 'warp'
cask 'wifiman'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
vscode "angular.ng-template"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"